# Задача 4_1
def my_func(x, y):
    c = (x ** y)
    print(c)

my_func(x=int(input("введите положительное число x : ")),y=int(input("введите целое отрицательное число y : ")))
